{
  "subject": "Programming for Problem Solving",
  "semester": 0,
  "course_code": "B20CS0102",
  "questions": [
    {
      "text": "Ensure that question paper is completely printed.",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "Students must check the course title and course code before answering the question paper. Marks UNIT I –",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) List and Classify the different types of operators available in C language. 10 b) Design and Develop a C program to find sum and difference of two given numbers. 5 c) Illustrate a C program to print your name and address. 5 d) Build a program to find area of Triangle. 5 OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Demonstrate the structure of C program with an example. 10 b) Illustrate a program to find if a number is positive or negative 5 c) Develop a C program to swap given two numbers 5 d) Construct a C program to find area of a sphere: for a given radius 5 UNIT – II 2 4𝜋𝑟",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Make use of array concept and illustrate declaration and initialization of array with an 5 example b) Design and develop C a program to find Sum of n different number entered by the 10 user. c) Develop a program to find if a triangle is scalene. A triangle is a scalene triangle if all 10 the three sides of the triangle are not equal to each other. (Use functions) OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Illustrate the working of nested if else with an example 5 b) Make use of array concept and develop a program to find Sum of composite number in 10 an array of numbers different containing numbers entered by the user. int input_array_size(); void input_array(int n, int a[n]); int sum_composite_numbers(int n, int a[n]); void out_put(int sum); c) Design and Develop a program to find gcd (hcf) of two numbers. 10 int input(); int gcd(int a, int b); void output(int a, int b, int gcd); UNIT – III",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Identify and illustrate operations on pointer. Develop a c program to demonstrate the 5 use of pointer. b) Summarize the basic data types associated with C and Illustrate a program to Add two 10 numbers using 4 functions and Pass by reference void input(int *a, int *b); void add(int a, int b, int *sum); void output(int a, int b, int sum); Page 1 of 2 c) Construct a program to find whether the three points form a triangle. 10 void input_triangle(float *x1, float *y1, float *x2, float *y2, float *x3, float *y3); int is_triangle(float x1, float y1, float x2, float y2,float x3, float y3) void output(float x1, float y1, float x2, float y2,float x3, float y3, int istriangle) OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Compare and contrast pass by value and pass by reference. 5 b) Demonstrate a program to find sum of two fractions. Write output with debugging 10 steps void input(int *num1, int *den1, int *num2, int *den2); void add(int num1,int den1, int num2, int den2, int *num3, int *den3); void output(int num1, int den1, int num2, int den2, int num3, int den3); c) Construct a program to Compare two strings 10 void input_two_string(char *a, char *b); int strcmp(char *a, char *b); void output(char *a, char *b, int result); UNIT – IV",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Illustrate the concept of array of structures with an example. 5 b) Demonstrate a program to find the area of a triangle. Write output with debugging 10 steps struct _triangle { float base,altitude,area; }; typedef _triangle Triangle Triangle input_triangle(); void find_area(Triangle *t); void output(Triangle t); c) Construct a program to find all the prime numbers between erotosthenes sieve 10 method. int input_array_size(); void init_array(int n, int a[n]; void erotosthenes_sieve(int n, int a[n]); void out_put(int n, int a[n]); OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Distinguish between Actual and formal arguments with an example 5 b) Identify and illustrate five different library functions for string 5 c) Infer the concept of Structure in C and Illustrate the declaration of structure with an 5 example. d) Build a program to find Sum of two complex numbers 10 struct _complex { float real,imaginary; }; typedef _complex Complex Complex input_complex(); Complex add(Complex a, Complex b); void output(Complex a, Complex b, Complex c); *** Page 2 of 2 SRN 1st Semester B.Tech CSE/C&IT Semester End Examination August 2023",
      "marks": 0,
      "section": "A",
      "unit": "1"
    }
  ],
  "pattern": {}
}