{
  "subject": "Communication Skills",
  "semester": 0,
  "course_code": "B22AH0103",
  "questions": [
    {
      "text": "Ensure that question paper is completely printed.",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "Students must check the course title and course code before answering the question paper Marks UNIT – I",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Discuss any five characteristics of effective communication. 5 b) Compose an introductory email to a prospective business client discussing your USP, 5 services, type of business etc. OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Distinguish between general purpose communication and professional communication 5 b) Develop a short dialogue between Amar and Tanya where Amar is giving instructions to 5 Tanya on how to use the new Dish washer. UNIT – II",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Study the following hints and explain how butter is processsed. 5 Milk obtained-Cream separated by churning-cream soured-cream pasteurized-butter obtained—forced into the roller to make it smooth-packed and sent off to market. b) Compose an informal letter to a close friend thanking him/her for going that extra mile 10 to coach you for your semester exams. OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Classify the traits of a good listener and a poor listener. 5 b) Explain the different types of listening with examples. 10 UNIT – III",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) ABC company has recently introduced a policy of subsidizing 50% of the tuition fee of 5 employees’ children. Construct a report in the Memo format announcing this policy. b) Discuss the various aspects of voice that determine the success of any speech or 5 presentation. OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Construct a paragraph on your Dream Destination. Include all the quintessential details 5 related to your destination. b) Outline the four major ways of delivering a speech with suitable examples. 5 UNIT – IV",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Explain the process of communication with a flowchart. 5 b) Compose a Cover Letter and CV for the following advertisement: 10 Urgently wanted competent Programmers at Ahimsacircle.com. Qualifications required: B.Tech/B.E /or any Computer Science Degree. Besides technical skills the candidate should possess excellent communication and inter- personal skills. Page 1 of 2 OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Make inference from the following paragraph and answer the following questions: 5 Opera refers to a dramatic art form, originating in Europe, in which the emotional content is conveyed to the audience as much through music, both vocal and instrumental, as it is through the lyrics. By contrast, in musical theater an actor's dramatic performance is primary, and the music plays a lesser role. The drama in opera is presented using the primary elements of theater such as scenery, costumes, and acting. However, the words of the opera, or libretto, are sung rather than spoken. The singers are accompanied by a musical ensemble ranging from a small instrumental ensemble to a full symphonic orchestra.",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "It is pointed out in the reading that opera ----. i. has developed under the influence of musical theater ii. as a drama sung with the accompaniment of an orchestra iii. is not a high-budget production iv. is often performed in Europe v. is the most complex of all the performing arts",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "An actor’s performance is less important than music-True/False",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "The word ‘Libretto’ refers to a --------------",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "A suitable title for the passage would be- i. Libretto ii Opera iii Musical Ensemble",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "From your reading of the passage what do you infer about the primary elements of theatre. b) Develop an essay on The influence of technology on human communication and 10 relationships with reference to Artificial Intelligence. *** Page 2 of 2 SRN 1st Semester B. Tech CSE/C&IT/ME/CV Semester End Examination September 2023",
      "marks": 0,
      "section": "A",
      "unit": "1"
    }
  ],
  "pattern": {}
}