{
  "subject": "Computer Graphics and Animation",
  "semester": 0,
  "course_code": "B18CS7062",
  "questions": [
    {
      "text": "a) OpenGL is a cross-language, cross-platform application programming interface 6 for rendering 2D and 3D vector graphics. Describe the various OpenGL functions. Also give any 5 geometric primitives specified by the set of vertices. b) Sierpinski triangle is a fractal and attractive fixed set with the overall shape of 7 an equilateral triangle which subdivides recursively into smaller triangles. Construct an OpenGL program to design 3D sierpinski Gasket by dividing the tetrahedron by 20 times. OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) A pinhole camera is a simple camera without a lens but with a tiny aperture. 6 Explain the concept of pinhole camera which is an example of an imaging system. Derive the expression for angle of view. Also indicate the advantages and disadvantages of this. b) Sierpinski triangle is a fractal and attractive fixed set with the overall shape of 7 an equilateral triangle which subdivides recursively into smaller triangles. Construct an OpenGL program to design 2D sierpinski Gasket by dividing the triangle by 30 times. UNIT – II",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Event-driven programming is the dominant paradigm used in graphical user 6 interfaces and other applications that are centered on performing certain actions in response to user input. Explain how the events can be generated by using Mouse and Keyboard. Generate the program to draw a small box at each location on the screen where the mouse is cursor is located. b) The geometric transformations play a vital role in generating images of 3D 6 objects with the help of the transformations. Illustrate on 3D transformations (translation, scaling and rotation) in homogenous coordinate system. OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Develop an OpenGL code to develop a colored cube and make the cube to rotate 6 along x,y and z axis by using mouse interaction. The speed of rotation need to be controlled trough keyboard. b) Transformations play an important role in computer graphics to reposition the 6 graphics on the screen and change their size or orientation. Explain the concatenation of transformation matrices. Derive the concatenated final matrix M for rotating a 3D object about a fixed point. UNIT – III",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Explain the graphics functions gluLookAt(), glOrtho(), glFrustum(), 6 gluPerspective() with suitable examples. Also determine the final projection matrices for parallel viewing. b) Construct the OpenGL program for demonstrating the cohen sutherland line 7 Page 1 of 2 clipping algorithm for clipping the line having the two end points at (60,20) and (80,120). Consider the clipping rectangle at (50,50) and (100,100). OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Projection is a technique or process which is used to transform a 3D object into a 6 2D plane. Explain Orthographic, Axonometric, Oblique, Perspective and Parallel Projections in Classical Viewing. b) The Liang-Barsky algorithm is more efficient than Cohen–Sutherland line clipping 7 algorithm and can be extended to 3-Dimensional clipping. Construct the OpenGL program for demonstrating the Liang-Barsky algorithm for clipping the line having the two end points at (60,20) and (80,120). Consider the clipping rectangle at (50,50) and (100,100). UNIT – IV",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) The drawing tools in Flash let us create and modify shapes for the artwork in our 6 movies. Explain the following tools, i) Drawing and Painting Tools ii) Colour iii) Adding Sound b) Frame-by-frame animation changes the contents of the Stage in every frame and 6 is best suited to complex animation in which an image changes in every frame instead of simply moving. Frame-by-frame animation increases file size more rapidly than tweened animation Use frame-by-frame animation when one needs to change an image in each frame. Explain the steps involved in animation of movie created frame by frame. OR",
      "marks": 0,
      "section": "A",
      "unit": "1"
    },
    {
      "text": "a) Flash is Windows-based software where we can start it using the Start menu 6 button and then clicking at the Flash submenus and options. Explain the following in Flash work environment. i) Stage and Time line ii) Symbols and Instances iii) Toolbox iv) Panels b) Layers are transparent sheets of acetate stacked on top of each other over which 6 the objects are drawn. Give the procedure for the following, i) Add a layer ii) Delete a layer, iii) Hide a layer iv) Properties reset v) Update the stacking order of layers. ****** Page 2 of 2 SRN 7th Semester B.Tech Semester End Examination Feb 2022",
      "marks": 0,
      "section": "A",
      "unit": "1"
    }
  ],
  "pattern": {}
}